## Data Inspection (head(), tail(), info(), describe(), shape)

##### 1. Write a line of code to display the first 3 rows of a DataFrame df.

In [1]:
import pandas as pd
import numpy as np


df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 32, 45],
    'Salary': [50000, 60000, 70000],
    'Department': ['HR', 'IT', 'Finance'],
    'City': ['New York', 'Chicago', 'San Francisco']
})
print(df.head(2))

    Name  Age  Salary Department      City
0  Alice   25   50000         HR  New York
1    Bob   32   60000         IT   Chicago

##### 2. Show the last 2 rows of df.

In [2]:
print(df.tail(2))

      Name  Age  Salary Department           City
1      Bob   32   60000         IT        Chicago
2  Charlie   45   70000    Finance  San Francisco

##### 3.Use .info() to print summary information of a DataFrame named employees.

In [3]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        3 non-null      object
 1   Age         3 non-null      int64
 2   Salary      3 non-null      int64
 3   Department  3 non-null      object
 4   City        3 non-null      object
dtypes: int64(2), object(3)
memory usage: 252.0+ bytes
None

##### 4.Get the shape of a DataFrame sales_data.

In [7]:
print(df.shape)

(3, 5)

##### 5. Print descriptive statistics of df including all columns (numeric + object).

In [8]:
print(df.describe())

             Age   Salary
count   3.000000      3.0
mean   34.000000  60000.0
std    10.148892  10000.0
min    25.000000  50000.0
25%    28.500000  55000.0
50%    32.000000  60000.0
75%    38.500000  65000.0
max    45.000000  70000.0

## Column and Row Access

##### 6. Access the column 'Salary' from DataFrame df.

In [9]:
print(df['Salary'])

0    50000
1    60000
2    70000
Name: Salary, dtype: int64

##### 7. Display only the columns 'Name' and 'Department' from df.

In [12]:
print(df[['Name' , 'Department']])

      Name Department
0    Alice         HR
1      Bob         IT
2  Charlie    Finance

##### 8.  Retrieve the row where Age is greater than 40.

In [14]:
print(df[(df['Age'] > 40)])

      Name  Age  Salary Department           City
2  Charlie   45   70000    Finance  San Francisco

##### 9.  Display rows where City is 'New York' or 'Chicago'.

In [20]:
print(df[(df['City'] == 'New York') | (df['City'] == 'Chicago')])

    Name  Age  Salary Department      City
0  Alice   25   50000         HR  New York
1    Bob   32   60000         IT   Chicago

##### 10.Filter all rows where Age > 30 and Salary > 50000.

In [24]:
print(df[(df['Age'] > 30 ) & (df['Salary'] > 50000 )])

      Name  Age  Salary Department           City
1      Bob   32   60000         IT        Chicago
2  Charlie   45   70000    Finance  San Francisco

## Adding and Updating Data

##### 11. Add a column 'Bonus' to df with values [1000, 2000, 3000].

In [29]:
 df.insert(3 , 'Bonus' , [1000 , 2000 , 30000])
print(df)

      Name  Age  Salary  Bonus Department           City
0    Alice   25   50000   1000         HR       New York
1      Bob   32   60000   2000         IT        Chicago
2  Charlie   45   70000  30000    Finance  San Francisco

##### 12. Insert a column 'City' at the second column position.

In [36]:
 df =df.drop('City' , axis = 1)

df.insert(1 , 'City' , ['New York', 'Chicago', 'San Francisco'])
print(df)

      Name           City  Age  Salary  Bonus Department
0    Alice       New York   25   50000   1000         HR
1      Bob        Chicago   32   60000   2000         IT
2  Charlie  San Francisco   45   70000  30000    Finance

##### 13. Update the 'Age' of the employee at index 2 to 45

In [38]:
df.loc[1 , 'Age'] = 45
print(df)

      Name           City  Age  Salary  Bonus Department
0    Alice       New York   25   50000   1000         HR
1      Bob        Chicago   45   60000   2000         IT
2  Charlie  San Francisco   45   70000  30000    Finance

##### 14. Change both 'Age' and 'Salary' for row 0 to 28 and 65000 respectively.

In [40]:
df.loc[0 , ['Age' , 'Salary']] = [28 , 65000]
print(df)

      Name           City  Age  Salary  Bonus Department
0    Alice       New York   28   65000   1000         HR
1      Bob        Chicago   45   60000   2000         IT
2  Charlie  San Francisco   45   70000  30000    Finance

##### 15. Multiply 'Salary' by 1.1 for employees with Age > 30.

In [41]:
df.loc[df['Age'] > 30 , 'Salary']  *=1.1
print(df)

      Name           City  Age  Salary  Bonus Department
0    Alice       New York   28   65000   1000         HR
1      Bob        Chicago   45   66000   2000         IT
2  Charlie  San Francisco   45   77000  30000    Finance

##  Removing Data

##### 16. Drop the column 'City' from DataFrame df

In [44]:
df = df.drop('City' , axis = 1)
print(df)

      Name  Age  Salary  Bonus Department
0    Alice   28   65000   1000         HR
1      Bob   45   66000   2000         IT
2  Charlie   45   77000  30000    Finance

##### 17. Drop columns 'Age' and 'Salary' from df.

In [45]:
df = df.drop(['Age' ,'Salary'] , axis = 1)
print(df)

      Name  Bonus Department
0    Alice   1000         HR
1      Bob   2000         IT
2  Charlie  30000    Finance

##### 18. Drop rows where any column has a missing value.

In [46]:
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', np.nan, 'David'],
    'Age': [25, np.nan, 45, 30],
    'Salary': [50000, 60000, np.nan, 80000],
    'Department': ['HR', np.nan, 'Finance', 'IT'],
    'City': ['New York', 'Chicago', 'San Francisco', np.nan]
})
df = df.dropna(axis = 0)
print(df)

    Name   Age   Salary Department      City
0  Alice  25.0  50000.0         HR  New York

##### 19. Drop columns that contain at least one missing value

In [48]:
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'AAAA', 'David'],
    'Age': [25, np.nan, 45, 30],
    'Salary': [50000, 60000, np.nan, 80000],
    'Department': ['HR', np.nan, 'Finance', 'IT'],
    'City': ['New York', 'Chicago', 'San Francisco', np.nan]
})
df = df.dropna(axis = 1)
print(df)

    Name
0  Alice
1    Bob
2   AAAA
3  David

##### 20 . Use inplace=True to drop column 'City' permanently.

In [49]:
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 32, 45],
    'Salary': [50000, 60000, 70000],
    'Department': ['HR', 'IT', 'Finance'],
    'City': ['New York', 'Chicago', 'San Francisco']
})
df = df.drop('City' , axis = 1 , inplace = True)
print(df)

None

## Handling Missing Values

##### 21. Write code to find missing values in a DataFrame df.

In [59]:
df_missing = pd.DataFrame({
    'Name': ['Alice', 'Bob', np.nan],
    'Age': [25, np.nan, 45],
    'Score': [85, np.nan, 95]
})
print(df_missing.isnull())

    Name    Age  Score
0  False  False  False
1  False   True   True
2   True  False  False

##### 22.Count missing values in each column.

In [54]:
print(df_missing.isnull().sum())

Name     1
Age      1
Score    1
dtype: int64

##### 23.Replace all missing values with 'Unknown'.

In [58]:
df = df_missing.fillna('unknown')
print(df)

      Name      Age    Score
0    Alice     25.0     85.0
1      Bob  unknown  unknown
2  unknown     45.0     95.0

##### 24.Fill missing values in column 'Age' with the mean of that column.

In [76]:
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', np.nan],
    'Age': [25, np.nan, 45],
    'Score': [85, np.nan, 95]
})
mean= df['Age'].mean()
df['Age'].fillna(mean , inplace = True)
print(df)

    Name   Age  Score
0  Alice  25.0   85.0
1    Bob  35.0    NaN
2    NaN  45.0   95.0

C:\Users\GOODLUCK\AppData\Local\Temp\ipykernel_3424\3858116251.py:7: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(mean , inplace = True)

##### 25.Interpolate missing values in column 'Score' using linear method.

## Sorting and Aggregation

##### 26. Sort DataFrame df by 'Salary' in descending order.

In [77]:
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 32, 45, 28, 35],
    'Salary': [50000, 60000, 70000, 65000, 62000],
    'Sales': [250, 400, 350, 300, 420]
})
sort = df.sort_values(by='Salary')
print(sort)

      Name  Age  Salary  Sales
0    Alice   25   50000    250
1      Bob   32   60000    400
4      Eva   35   62000    420
3    David   28   65000    300
2  Charlie   45   70000    350

##### 27. Sort df by 'Age' (ascending) and 'Salary' (descending).

In [90]:
print(df.sort_values(by=['Age' , 'Salary'] , ascending = [True,False]))

      Name  Age  Salary  Sales
0    Alice   25   50000    250
3    David   28   65000    300
1      Bob   32   60000    400
4      Eva   35   62000    420
2  Charlie   45   70000    350
int64

##### 28. Calculate the sum of 'Points' in DataFrame stats.

In [91]:
data = {
    'Points': [10, 20, 30, 40, 50],
    'Sales': [250.5, 300.0, 400.75, 150.25, 500.0],
    'Age': [25, 32, 40, 28, 35],
    'Salary': [50000, 60000, 80000, 55000, 70000]
}

df = pd.DataFrame(data) 
summ = df['Points'].sum()
print(summ)

150

##### 29. Find the standard deviation of 'Sales' in DataFrame df.

In [92]:
std = df['Sales'].std()
print(std)

135.060565118024

##### 30. Use .agg() to get mean and max of both 'Age' and 'Salary'.

In [94]:
print(df.agg({'Age' : ['mean' , 'max'] , 'Salary' : ['mean' , 'max']  }))

       Age   Salary
mean  32.0  63000.0
max   40.0  80000.0

## Grouping

##### 31. Group df by 'Department' and calculate average 'Salary'.

In [5]:
import pandas as pd
data = {
    'Department': ['Sales', 'HR', 'IT', 'Sales', 'HR', 'IT', 'Sales', 'IT', 'HR'],
    'Salary': [50000, 60000, 70000, 55000, 62000, 72000, 52000, 73000, 61000],
    'City': ['New York', 'Los Angeles', 'New York', 'Chicago', 'Los Angeles', 'Chicago', 'New York', 'Chicago', 'Los Angeles'],
    'Gender': ['Male', 'Female', 'Male', 'Female', 'Male', 'Female', 'Female', 'Male', 'Female'],
    'Age': [25, 30, 35, 28, 45, 40, 26, 38, 29],
    'Sales': [12000, 8000, 11000, 9500, 10500, 9800, 15000, 10200, 8700],
    'Score': [85, 90, 78, 92, 88, 76, 80, 95, 89],
    'Class': ['A', 'A', 'B', 'A', 'B', 'C', 'C', 'C', 'A']
}

df= pd.DataFrame(data)
grouped = df.groupby('Department')['Salary'].mean()
print(grouped)

Department
HR       61000.000000
IT       71666.666667
Sales    52333.333333
Name: Salary, dtype: float64

##### 32. Group by 'City' and count how many records per city

In [6]:
grouped = df.groupby('City').size()
print(grouped)

City
Chicago        3
Los Angeles    3
New York       3
dtype: int64

##### 33. Group by 'Gender' and get max 'Age' and min 'Salary'

In [7]:
grouped = df.groupby('Gender').agg({'Age' : 'max' , 'Salary' : 'min'})
print(grouped)

        Age  Salary
Gender
Female   40   52000
Male     45   50000

##### 34. Filter groups in df.groupby('City') where average 'Sales' > 10000.

In [10]:
grouped = df.groupby('City')['Salary'].mean()
print(grouped > 10000)

City
Chicago        True
Los Angeles    True
New York       True
Name: Salary, dtype: bool

##### 35. Use transform() to normalize 'Score' column within each 'Class'

## MultiIndex & Grouping by Index

##### 36. Convert df with columns 'Team' and 'Year' into a MultiIndex.

In [15]:
arrays = [
    ['TeamA', 'TeamA', 'TeamB', 'TeamB'],
    [2021, 2022, 2021, 2022]
]
index = pd.MultiIndex.from_arrays(arrays, names=('Team', 'Year'))

df_multi = pd.DataFrame({
    'Points': [85, 88, 90, 92]
}, index=index)

##### 37.Group by the first level ('Team') of the MultiIndex and get sum of 'Points'.

##### 38. Use reset_index() to flatten a MultiIndex DataFrame.

##  Joins

##### 39. Join df1 and df2 using an inner join on the index

In [19]:
df1 = pd.DataFrame({
    'ID': [1, 2, 3 , 4],
    'Name': ['Alice', 'Bob', 'Charlie' , 'John'],
    'Score': [85, 90, 95 ,67]
}, index = [1,2,3,4] )

df2 = pd.DataFrame({
    'ID': [2, 3, 4],
    'Grade': ['B', 'A', 'C']
}, index = [1,2,3])
inner_join = df1.join(df2 , how = 'inner' ,  lsuffix='_df1', rsuffix='_df2')
print(inner_join)

   ID_df1     Name  Score  ID_df2 Grade
1       1    Alice     85       2     B
2       2      Bob     90       3     A
3       3  Charlie     95       4     C

##### 40.Perform a left join between df1 and df2 on index

In [21]:
left_join = df1.join(df2 , how = 'left' , lsuffix = 'df1' , rsuffix = 'df2')
print(left_join)

   IDdf1     Name  Score  IDdf2 Grade
1      1    Alice     85    2.0     B
2      2      Bob     90    3.0     A
3      3  Charlie     95    4.0     C
4      4     John     67    NaN   NaN

##### 41.Write code to join two DataFrames df1 and df2 using how='outer'.

In [22]:
outer_join = df1.join(df2 , how = 'outer' , lsuffix = 'df1' , rsuffix = 'df2')
print(outer_join)

   IDdf1     Name  Score  IDdf2 Grade
1      1    Alice     85    2.0     B
2      2      Bob     90    3.0     A
3      3  Charlie     95    4.0     C
4      4     John     67    NaN   NaN

##### 42. Show how to join on a column instead of the index using merge()

In [24]:
merge = pd.merge(df1 , df2 , on='ID' , how ='left')
print(merge)

   ID     Name  Score Grade
0   1    Alice     85   NaN
1   2      Bob     90     B
2   3  Charlie     95     A
3   4     John     67     C

##  Concatenation

##### 43. Concatenate two DataFrames vertically (along rows).

In [26]:
df_concat1 = pd.DataFrame({
    'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2']
}, index=[0, 1, 2])

df_concat2 = pd.DataFrame({
    'A': ['A3', 'A4', 'A5'],
    'B': ['B3', 'B4', 'B5']
}, index=[3, 4, 5])
vertically = pd.concat([df1 , df2] , axis =0)
print(vertically)

   ID     Name  Score Grade
1   1    Alice   85.0   NaN
2   2      Bob   90.0   NaN
3   3  Charlie   95.0   NaN
4   4     John   67.0   NaN
1   2      NaN    NaN     B
2   3      NaN    NaN     A
3   4      NaN    NaN     C

##### 44. Concatenate df1 and df2 horizontally (along columns)

In [28]:
horizontally= pd.concat([df1 , df2] , axis =1)
print(horizontally)

   ID     Name  Score   ID Grade
1   1    Alice     85  2.0     B
2   2      Bob     90  3.0     A
3   3  Charlie     95  4.0     C
4   4     John     67  NaN   NaN

##### 45. Concatenate with keys=['df1', 'df2'] and access 'df1' rows.

In [33]:
concatenate = pd.concat([df1 , df2], axis = 0 , keys = ['df1' , 'df2'])
print(concatenate)
print(conatenate.loc['df1'])

       ID     Name  Score Grade
df1 1   1    Alice   85.0   NaN
    2   2      Bob   90.0   NaN
    3   3  Charlie   95.0   NaN
    4   4     John   67.0   NaN
df2 1   2      NaN    NaN     B
    2   3      NaN    NaN     A
    3   4      NaN    NaN     C
   ID     Name  Score Grade
1   1    Alice   85.0   NaN
2   2      Bob   90.0   NaN
3   3  Charlie   95.0   NaN
4   4     John   67.0   NaN

##### 46.After vertical concat, reset the index and drop the old index

In [29]:
vertically = pd.concat([df1 , df2] , axis =0).reset_index(drop=True)
print(vertically)

   ID     Name  Score Grade
0   1    Alice   85.0   NaN
1   2      Bob   90.0   NaN
2   3  Charlie   95.0   NaN
3   4     John   67.0   NaN
4   2      NaN    NaN     B
5   3      NaN    NaN     A
6   4      NaN    NaN     C